In [2]:
from sqlalchemy import create_engine
import pandas as pd
from snowflake.sqlalchemy import URL

engine = create_engine(
    'snowflake://{user}:{password}@{account}/d'.format(
        user='ESTPEGION',
        password='SnowFlake1234!',
        account='mg61873.ca-central-1.aws',
        database = 'KPMG',
        schema = 'public',
        warehouse = 'COMPUTE_WH',
        role='accountadmin',
        numpy = True
    )
)

connection = engine.connect()
results = connection.execute('select current_version()').fetchone()
print(results[0])

import pandas as pd
pd.read_sql_query('''USE SCHEMA SNOWFLAKE_SAMPLE_DATA.TPCDS_SF10TCL;''',engine)
# finally:
#     connection.close()
#     engine.dispose()

/Users/raydenx/opt/anaconda3/lib/python3.9/site-packages/snowflake/connector/options.py:96: UserWarning: You have an incompatible version of 'pyarrow' installed (11.0.0), please install a version that adheres to: 'pyarrow<10.1.0,>=10.0.1; extra == "pandas"'
  warn_incompatible_dep(

7.8.1

                             status
0  Statement executed successfully.

In [5]:
# url = f'snowflake://ESTPEGION:SnowFlake1234!@mg61873.ca-central-1.aws/KPMG/public?warehouse=testwh&role=myrole'

In [3]:
import pandas as pd
pd.read_sql_query('''USE SCHEMA SNOWFLAKE_SAMPLE_DATA.TPCDS_SF10TCL;''',engine)

                             status
0  Statement executed successfully.

In [7]:
pd.read_sql_query('select * from WEB_SALES limit 100',engine)

,ws_sold_date_sk,ws_sold_time_sk,ws_ship_date_sk,ws_item_sk,ws_bill_customer_sk,ws_bill_cdemo_sk,ws_bill_hdemo_sk,ws_bill_addr_sk,ws_ship_customer_sk,ws_ship_cdemo_sk,...,ws_ext_wholesale_cost,ws_ext_list_price,ws_ext_tax,ws_coupon_amt,ws_ext_ship_cost,ws_net_paid,ws_net_paid_inc_tax,ws_net_paid_inc_ship,ws_net_paid_inc_ship_tax,ws_net_profit
0,2451864,3080,2451926,204037,28943167,84819,5671,19067770,176566,1860296,...,1287.90,3322.65,90.37,0.00,1395.45,1129.65,1220.02,2525.10,2615.47,-158.25
1,2451864,16316,2451884,204037,42194195,1281028,2261,20123941,49297995,731471,...,4211.42,5768.88,29.42,0.00,1499.84,2942.06,2971.48,4441.90,4471.32,-1269.36
2,2451864,64808,2451976,204037,46206237,848560,483,15232406,29858941,1275759,...,270.00,653.25,22.40,0.00,97.75,320.00,342.40,417.75,440.15,50.00
3,2451864,62886,2451932,204037,51872342,1216561,5227,28697446,60184827,1626059,...,1945.84,3755.44,1.49,0.00,938.86,74.88,76.37,1013.74,1015.23,-1870.96
4,2451864,67631,2451907,204037,9690277,1477980,83,3716586,56015598,489627,...,321.44,700.70,18.18,0.00,245.00,454.72,472.90,699.72,717.90,133.28
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,2451864,39861,2451977,204043,8407156,759616,2829,24457689,18592231,122427,...,572.88,1139.82,43.06,0.00,79.53,478.50,521.56,558.03,601.09,-94.38
96,2451864,48547,2451937,204043,11127150,422653,909,1695965,34417011,163961,...,652.34,1434.94,24.10,0.00,28.60,803.40,827.50,832.00,856.10,151.06
97,2451864,19581,2451918,204043,9559403,1661858,4760,21308015,59106576,281159,...,1613.48,4436.88,0.00,0.00,1197.76,177.46,177.46,1375.22,1375.22,-1436.02
98,2451864,54038,2451868,204043,33619702,441748,6994,6967793,23535502,265135,...,270.72,695.60,14.73,0.00,132.07,368.48,383.21,500.55,515.28,97.76
99,2451864,20589,2451946,204043,64401776,1384304,1232,18251760,64401776,1384304,...,9012.96,9823.77,50.56,2144.97,3241.26,1685.34,1735.90,4926.60,4977.16,-7327.62

In [5]:
q60_c = list(pd.read_sql_query('select DISTINCT I_category from item limit 100',engine))

In [4]:
# # question 2
# pd.read_sql_query('''
# WITH wscs AS
#   (SELECT sold_date_sk,
#           sales_price
#    FROM
#      (SELECT ws_sold_date_sk sold_date_sk,
#              ws_ext_sales_price sales_price
#       FROM web_sales
#       UNION ALL SELECT cs_sold_date_sk sold_date_sk,
#                        cs_ext_sales_price sales_price
#       FROM catalog_sales) sq1
#       ),
#      wswscs AS
#   (SELECT d_week_seq,
#           sum(CASE
#                   WHEN (d_day_name='Sunday') THEN sales_price
#                   ELSE NULL
#               END) sun_sales,
#           sum(CASE
#                   WHEN (d_day_name='Monday') THEN sales_price
#                   ELSE NULL
#               END) mon_sales,
#           sum(CASE
#                   WHEN (d_day_name='Tuesday') THEN sales_price
#                   ELSE NULL
#               END) tue_sales,
#           sum(CASE
#                   WHEN (d_day_name='Wednesday') THEN sales_price
#                   ELSE NULL
#               END) wed_sales,
#           sum(CASE
#                   WHEN (d_day_name='Thursday') THEN sales_price
#                   ELSE NULL
#               END) thu_sales,
#           sum(CASE
#                   WHEN (d_day_name='Friday') THEN sales_price
#                   ELSE NULL
#               END) fri_sales,
#           sum(CASE
#                   WHEN (d_day_name='Saturday') THEN sales_price
#                   ELSE NULL
#               END) sat_sales
#    FROM wscs,
#         date_dim
#    WHERE d_date_sk = sold_date_sk
#    GROUP BY d_week_seq
#    limit 10000)
# SELECT d_week_seq1,
#        round(sun_sales1/sun_sales2, 2),
#        round(mon_sales1/mon_sales2, 2),
#        round(tue_sales1/tue_sales2, 2),
#        round(wed_sales1/wed_sales2, 2),
#        round(thu_sales1/thu_sales2, 2),
#        round(fri_sales1/fri_sales2, 2),
#        round(sat_sales1/sat_sales2, 2)
# FROM
#   (SELECT wswscs.d_week_seq d_week_seq1,
#           sun_sales sun_sales1,
#           mon_sales mon_sales1,
#           tue_sales tue_sales1,
#           wed_sales wed_sales1,
#           thu_sales thu_sales1,
#           fri_sales fri_sales1,
#           sat_sales sat_sales1
#    FROM wswscs,
#         date_dim
#    WHERE date_dim.d_week_seq = wswscs.d_week_seq
#      AND d_year = 2001) y,
#   (SELECT wswscs.d_week_seq d_week_seq2,
#           sun_sales sun_sales2,
#           mon_sales mon_sales2,
#           tue_sales tue_sales2,
#           wed_sales wed_sales2,
#           thu_sales thu_sales2,
#           fri_sales fri_sales2,
#           sat_sales sat_sales2
#    FROM wswscs,
#         date_dim
#    WHERE date_dim.d_week_seq = wswscs.d_week_seq
#      AND d_year = 2001+1) z
# WHERE d_week_seq1 = d_week_seq2-53
# ORDER BY d_week_seq1
# limit 1000;
# ''',engine)

,d_week_seq1,"ROUND(SUN_SALES1/SUN_SALES2, 2)","ROUND(MON_SALES1/MON_SALES2, 2)","ROUND(TUE_SALES1/TUE_SALES2, 2)","ROUND(WED_SALES1/WED_SALES2, 2)","ROUND(THU_SALES1/THU_SALES2, 2)","ROUND(FRI_SALES1/FRI_SALES2, 2)","ROUND(SAT_SALES1/SAT_SALES2, 2)"
0,5270,3.44,1.82,1.89,1.6,3.45,3.44,3.44
1,5270,3.44,1.82,1.89,1.6,3.45,3.44,3.44
2,5270,3.44,1.82,1.89,1.6,3.45,3.44,3.44
3,5270,3.44,1.82,1.89,1.6,3.45,3.44,3.44
4,5270,3.44,1.82,1.89,1.6,3.45,3.44,3.44
...,...,...,...,...,...,...,...,...
995,5291,1.00,1.00,1.00,1.0,1.00,1.00,1.00
996,5291,1.00,1.00,1.00,1.0,1.00,1.00,1.00
997,5291,1.00,1.00,1.00,1.0,1.00,1.00,1.00
998,5291,1.00,1.00,1.00,1.0,1.00,1.00,1.00
999,5291,1.00,1.00,1.00,1.0,1.00,1.00,1.00

In [8]:
#QUESTION1
pd.read_sql_query('''with customer_total_return as
(select sr_customer_sk as ctr_customer_sk
,sr_store_sk as ctr_store_sk
,sum(SR_RETURN_QUANTITY) as ctr_total_return
from store_returns
,date_dim
where sr_returned_date_sk = d_date_sk
and d_year = 2000
group by sr_customer_sk
,sr_store_sk
limit 500)
 select  c_customer_id
from customer_total_return ctr1
,store
,customer
where ctr1.ctr_total_return > (select avg(ctr_total_return)*1.2
from customer_total_return ctr2
where ctr1.ctr_store_sk = ctr2.ctr_store_sk)
and s_store_sk = ctr1.ctr_store_sk
and s_state = 'TN'
and ctr1.ctr_customer_sk = c_customer_sk
order by c_customer_id
 limit 5;''',engine)

      c_customer_id
0  AAAAAAAABNHMLMDA
1  AAAAAAAAFJCFEMAA
2  AAAAAAAAIJDJDKCA
3  AAAAAAAAKLIPJADA
4  AAAAAAAALDCEJOBA

# Variable_Store_Json

In [20]:
#YEAR.01 corresponding to d_year of date_dim

pd.read_sql_query('''SELECT DISTINCT d_year FROM date_dim;''', engine)

     d_year
0      1900
1      1901
2      1902
3      1903
4      1904
..      ...
196    2057
197    2064
198    2071
199    2082
200    2049

[201 rows x 1 columns]

In [7]:
#STATE.01 corresponding to s_state in store

q1_state = pd.read_sql_query('''SELECT DISTINCT s_state FROM store;''', engine)

In [15]:
list(q1_state.values.T[0]).

['TN',
 'NM',
 'KY',
 'IA',
 'NC',
 'OH',
 'GA',
 'IN',
 'AL',
 'SC',
 'MD',
 'LA',
 'SD',
 'MI',
 'FL',
 'WV',
 'VT',
 'TX',
 'MT',
 'CA',
 'NJ',
 'CO',
 'OK',
 'IL',
 None,
 'NE',
 'OR',
 'NY',
 'MO',
 'WI',
 'VA',
 'PA',
 'WA',
 'KS',
 'MN']

In [6]:
#Add variable in json here!

import json
var_store = {}
var_store['q1_state'] = ['TN',
 'NM',
 'KY',
 'IA',
 'NC',
 'OH',
 'GA',
 'IN',
 'AL',
 'SC',
 'MD',
 'LA',
 'SD',
 'MI',
 'FL',
 'WV',
 'VT',
 'TX',
 'MT',
 'CA',
 'NJ',
 'CO',
 'OK',
 'IL',
 'None',
 'NE',
 'OR',
 'NY',
 'MO',
 'WI',
 'VA',
 'PA',
 'WA',
 'KS',
 'MN']



var_store['q1_agg'] = ['SR_RETURN_AMT','SR_RETURN_AMT_INC_TAX','SR_RETURN_QUANTITY','SR_RETURN_TAX','SR_RETURN_SHIP_COST']
var_store['q3_aggc']= ["ss_sold_date_sk","ss_sold_time_sk","ss_item_sk","ss_customer_sk","ss_cdemo_sk","ss_hdemo_sk","ss_addr_sk","ss_store_sk","ss_promo_sk","ss_ticket_number","ss_quantity","ss_wholesale_cost","ss_list_price","ss_sales_price","ss_ext_discount_amt","ss_ext_sales_price","ss_ext_wholesale_cost","ss_ext_list_price","ss_ext_tax","ss_coupon_amt","ss_net_paid","ss_net_paid_inc_tax","ss_net_profit"] 
var_store['q60_c'] = q60_c
var_store

var_store_json = json.dumps(var_store,sort_keys=False,separators=(',', ': '))
# Writing to var_store.json
with open("var_store.json", "w") as outfile:
    outfile.write(var_store_json)

In [7]:
type(json.load(open('var_store.json'))['q1_state'])
type(json.load(open('var_store.json'))['q3_aggc'])
type(json.load(open('var_store.json'))['q60_c'])

list